# Homebrew Bundle File
# To install: brew bundle --file=Brewfile

# Formulae
brew "awscli"
brew "bash"
brew "bat"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "go"
brew "helm"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "lazygit"
brew "neovim"
brew "nmap"
brew "node"
brew "ollama"
brew "opencode"
brew "openjdk"
brew "parallel"
brew "pnpm"
brew "python@3.13"
brew "python@3.14"
brew "ripgrep"
brew "rustscan"
brew "starship"
brew "stow"
brew "telnet"
brew "terraform"
brew "tree"
brew "uv"
brew "wget"
brew "yq"
brew "tmux"

# Casks
cask "docker-desktop"
cask "flameshot"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "jordanbaird-ice"
cask "ollama-app"
cask "raycast"
cask "shortcat"
cask "steam"
cask "visual-studio-code"
cask "whatsapp"
cask "whisky"
cask "wispr-flow"
cask "zed"
cask "zen"
cask "zulu@8"
cask "claude-code"
